---
kind: method
id: M:Autodesk.Revit.DB.DisplacementElement.GetRelativeDisplacement
source: html/a2e39847-b4bb-1d58-91e1-cbc16c89b638.htm
---
# Autodesk.Revit.DB.DisplacementElement.GetRelativeDisplacement Method

The relative displacement applied to the displaced elements by this DisplacementElement.

## Syntax (C#)
```csharp
public XYZ GetRelativeDisplacement()
```

## Returns
The relative displacement.